In [83]:
import pandas as pd

In [84]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [85]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [86]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [87]:
df1.shape

(7, 3)

In [88]:
print('Number of rows',df1.shape[0])
print('Number of columns',df1.shape[1])

Number of rows 7
Number of columns 3

In [89]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [90]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [91]:
df1.describe(include='all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Krisha        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

In [92]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [93]:
df1['Gender'].nunique()

2

In [94]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [95]:
# don't forget to put both of these conditions inside brackets ()

# method 1
len(df1[(df1['Marks']>=90)&(df1['Marks']<=100)])

# method 2
sum(df1['Marks'].between(90,100))

4

In [96]:
# how to get mean marks
df1['Marks'].mean()

# how to get max marks
df1['Marks'].max()

# how to get min marks
df1['Marks'].min()

83

In [97]:
def marks(x):
    return x//2

In [98]:
df1['Half_marks'] = df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [99]:
df1['Lambda_Half_marks']=df1['Marks'].apply(lambda x:x/2)

In [100]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [101]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half_marks  Lambda_Half_marks  Male_Female
0  Priyang     98    Male          49               49.0            1
1   Aadhya     89  Female          44               44.5            0
2   Krisha     99  Female          49               49.5            0
3   Vedant     87    Male          43               43.5            1
4   Parshv     90    Male          45               45.0            1
5   Mittal     83  Female          41               41.5            0
6  Archana     99  Female          49               49.5            0

In [102]:
df1.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [103]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [104]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender  Lambda_Half_marks
2   Krisha     99  Female               49.5
6  Archana     99  Female               49.5
0  Priyang     98    Male               49.0
4   Parshv     90    Male               45.0
1   Aadhya     89  Female               44.5
3   Vedant     87    Male               43.5
5   Mittal     83  Female               41.5

Getting the name and marks of female students using a Gender filter and mask

In [105]:
df1[df1['Gender'] == "Female"][['Marks',"Name"]]

   Marks     Name
1     89   Aadhya
2     99   Krisha
5     83   Mittal
6     99  Archana

Using the .isin() method

In [109]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99